'use strict'


// Задание 1.


/* Вернуть все числа от 0 до 100, являющиеся простыми.
Переменной "а" присваиваю значение "0" и с помощью цикла while ограничиваю верхний предел значения "а" (100) указываю, и проверяю что число является простым.
Вывожу в консоль значение "а".  */
// let a = 0;

// while (a < 100) {
//     if (primeNumber(a)) {
//         console.log(a);
//     }
//     // после каждой проверки увеличиваю значение "а" на 1
//     a++;
// }
// // выбираю все числа начиная с "2"
// function primeNumber(a) {
//     if (a < 2) {
//         return false;
//     }
//     // все числа делятся на "1", поэтому начинаем с делителя "2", при условии, что делитель меньше самого числа, т.к. число должно делиться на само себя
//     for (let i = 2; i < a; i++) {

//         // если число и делитель дают остаток раный "0", то число не является простым
//         if (a % i === 0) {
//             return false;
//         }
//     }

//     return true;
// }




// Задание 2.

// ['наименование', 'цена за шт.', 'кол-во шт']

// let cart = [
//     ['pen', 23, 60],
//     ['notebook', 20, 9],
//     ['pencil', 10, 5],
// ];

// function countCartPrice(cart) {
//     let totalPrice = 0;
//     console.log(countCartPrice);
//     for (let i = 0; i < cart.lenght; i++) {
//         totalPrice += cart[i][1] * cart[i][2];
//     }
//     return totalPrice;
// }





